{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4d2" }, "name" : "Duangrat's Thai Restaurant", "description" : "<h2>Thai, $15+</h2><p>One of my top restaurants. There's been a sad commodification of Thai restaurants in suburban America (see: Tara Thai), and it's easy to forget there's more to it than Pad Thai with shrimp.  Duangrats is one of the best restaurants, at any price, in NOVA, and it's cheap.  I've never had anything on the menu that I didn't think was stellar, and the tastes are seriously that of a restaurant 2 to 3 times as expensive.  In a very unassuming building in an unassuming area, Duangrats is a gem.</p><p>Go exclusively for the small plates/tapas menu, which I believe is 11am-3pm on Weekends and 5-630pm on weekdays. I generally don't believe in tapas, but Duangrats has made me a believer.  It's overwhelmingly in your interests to try something different here, like a fried fish dish, rather than something generic like \"drunken noodles.\"  But go for the small plates menu.  My fav small plates: pork stuffed lychee, beef crepe, deep fried cod, and grilled calamari.  But they're all good.</p>", "price" : "med", "ethnicity" : [ "Thai" ], "tags" : [ "BestOf" ], "coordinates" : { "lng" : "-77.134026", "lat" : "38.853264" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4d3" }, "name" : "R&R Taqueria", "description" : "<h2>Mexican, &lt;$10</h2><p>I drove 40 minutes both ways with a group of friends to try this place, which is roughly 10 minutes outside of Baltimore.  It's literally within the corner of a Sunoco gas station, with no visible sign from the street indicating that there's a restaurant inside.  The ordering menus are hand-written and taped to the wall, and the maximum occupancy of the facility itself is a single table with 3 bar stools.  The food, however, is incredible.<p><p>When I got to the restaurant (if you can call it that) I told the guy behind the counter that I drove 40 minutes to get there and had no idea what to order.  He said, \"don't worry, I'll take care of you guys.\"  He proceeded to bring out a collection of tacos, huaraches, tortas, steak dishes, etc.  Everything was fantastic.  The meats were well spiced and the use of real Mexican cheese and freshly made tortillas made a huge difference. My single favorite item was the beef tongue tacos.  After a satisfying and substantial meal we were ready to foot a significant bill, but the final tally?  A little over $40 for four people.  Crazy.</p>", "price" : "low", "ethnicity" : [ "Mexican" ], "tags" : [ "Tacos", "BestOf" ], "coordinates" : { "lng" : "-76.784607", "lat" : "39.172413" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4d4" }, "name" : "Tachibana Japanese Restaurant", "description" : "<h2>Sushi, $25-$30</h2><p>One of my top restaurants in NOVA.  The best sushi restaurant in the area, and owned by actual Japanese people, which I think makes a difference.  The difference in the quality of fish here is distinct compared to other sushi restaurants in the area.  If it's not a weekday, make a reservation.  I like it so much that I go here with the fam on my birthdays.  I don't think ordering the sushi deluxe is worth it unless you especially enjoy the taste of sea urchin.</p>", "price" : "high", "ethnicity" : [ "Japanese" ], "tags" : [ "Sushi", "BestOf" ], "coordinates" : { "lng" : "-77.176147", "lat" : "38.932320" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4d5" }, "name" : "Rose Kabob Restaurant", "description" : "<h2>Iranian Kabobs, ~$15</h2><p>One of my top restaurants.  I hype up this place like crazy to everyone I know and it always lives up to the hype.  While people say all the meats are good, I only ever order the Chicken platter with half rice, half salad.  If you&#39;re not super hungry, get the Chicken Kabob Junior, which is probably 80% of the non-junior portion.</p>", "price" : "med", "ethnicity" : [ "Iranian" ], "tags" : [ "Kabobs", "BestOf" ], "coordinates" : { "lng" : "-77.265999", "lat" : "38.900791" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4d6" }, "name" : "Ray's the Steaks", "description" : "<h2>Steaks, $30-$40+</h2><p>One of my top restaurants. This is as expensive as I typically get, and it's worth it. The best steak I've had anywhere, including cumberbund-mandatory places like Mortons. They don't do that \"dip in clarified butter before serving\" thing that most expensive restaurants do -- I hate that. Steaks come with unlimited garlic mashed potatoes and creamed spinach, and complimentary bread and seasoned cashews to start. I really like the Cajun Ribeye, but even the $20 hanger steak is great.&nbsp; Because the meat quality is high, order your steak rarer than \"medium.\"&nbsp; I'm a medium-rare guy myself.</p>", "price" : "high", "ethnicity" : [ "American" ], "tags" : [ "Steak", "BestOf" ], "coordinates" : { "lng" : "-77.086563", "lat" : "38.890537" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4d7" }, "name" : "Yuraku Japanese Restaurant", "description" : "<h2>Sushi, $12-$13</h2><p>Yuraku has a lunch buffet which is super cheap (~$12) and solid, but if you have a choice go for dinner because the dinner is amazing.  Yuraku has the highest quality sushi rolls I've ever had.  There's a ton of variety, the fish is high quality, and the rolls themselves are massive.  Bigger than you've seen anywhere else.  And despite the size and quality of the food it's still cheaper per roll/piece than other sushi restaurants in the area.<p><p>Of course, there's always a catch.  Yelp reviews say that the wait at this place can get long during prime times, which I believe due to both the low price and smaller size of the facility.  I went at 2:00pm on a Saturday and seating was clear, so I'd recommend that for others who are willing to make the ~30min trek to Germantown, MD.  Definitely a great find.</p>", "price" : "med", "ethnicity" : [ "Japanese" ], "tags" : [ "Sushi", "BestOf" ], "coordinates" : { "lng" : "-77.236664", "lat" : "39.180511" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4d8" }, "name" : "Ray's Hell Burgers", "description" : "<h2>Burgers, $10-$15</h2><p>The best burger in NOVA.  This place should supplant the completely underwhelming \"Ben's Chili Bowl\" as the iconic DC-area eatery. Lots of options and you won't leave hungry.  Other notes: (1) Parking here is terrible.  You'll probably wait for a spot. (2) Sweet potato fries. 'Nuff said.  (3) The au poivre burger will make peppercorns get stuck in your teeth.</p><p><em>Note (3/1/2013):</e> Word on the street is that RHB is closed indefinitely due to a landlord dispute.  So lame.</p></p>", "price" : "high", "ethnicity" : [ "American" ], "tags" : [ "Burgers", "BestOf" ], "coordinates" : { "lng" : "-77.078789", "lat" : "38.894123" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4d9" }, "name" : "A & J Restaurant", "description" : "<h2>Taiwanese, $10</h2><p>I really love A&amp;J, which is (so I hear) an authentic Taiwanese restaurant.  I love Taiwanese food because it's so much lighter than typical Americanized Chinese food.  The menu is almost tapas like, and it's fun because you can order a bunch of smaller $4-$5 dishes and share amongst friends.  They also have good beef noodle soup.  My favorite dishes are the fried chicken with rice, pulled noodle soups and the rice dish with the pork and boiled egg (sounds strange, but it's fantastic).</p><p>I also really love the ja ja mien, which is the Chinese version of the Korean ja jang myun (noodles with black bean sauce).  It's much lighter than the Korean version with fresh veggies and a lighter sauce.  I actually prefer it to the Korean variant.</p>", "price" : "low", "ethnicity" : [ "Taiwanese" ], "tags" : [ "BestOf" ], "coordinates" : { "lng" : "-77.200989", "lat" : "38.830288" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4da" }, "name" : "Pho Sate", "description" : "<h2>Pho, $8</h2><p>Okay so let&#39;s stop fooling ourselves, 90% of pho joints are exactly the same.  Unless you hail from Saigon you&#39;re not really differentiating nuances in broth.  Superficially Pho Sate is like that, until they bring out the dish of Sate sauce and blow every other pho restaurant out of the water.  It&#39;s a non-spicy, smokey pepper oil that you pour into the broth that makes the world a better place.  Their other soup dishes are pretty good too; I like the seafood egg noodle bowl.  Like every other pho restaurant your food will come out in 30 seconds.  Cash only.</p>", "price" : "low", "ethnicity" : [ "Vietnamese" ], "tags" : [ "BestOf" ], "coordinates" : { "lng" : "-77.191292", "lat" : "38.876064" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4db" }, "name" : "Kabob Palace", "description" : "<h2>Afghan Kabobs, $15</h2><p>Kabob Palace is a 24 hour Afghan Kabob restaurant in Crystal City and highly regarded by pretty much everybody.  The clientele, while diverse due to popularity, is still highly native most of the time -- always a sign of a solid and authentic eatery.  The biggest differentiation between this place and Rose Kabob is the sides they give you; the chickpeas and spinach (or half and half) are amazing.  Very, very well seasoned and lots of flavors.</p><p>For kabobs my favorite plate here is the bone-in chicken, but if you can handle some heat arguably the best dish I know of in NOVA is the lamb karahi.  Google it.  It's spicy lamb cooked slowly in a big copper pot and it takes 30 minutes from order to your table.  It is so. freaking. good.  It's what all the native speakers order.<p>", "price" : "low", "ethnicity" : [ "Afghan" ], "tags" : [ "Kabobs", "BestOf" ], "coordinates" : { "lng" : "-77.053444", "lat" : "38.853222" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4dc" }, "name" : "Sushi Yoshi", "description" : "<h2>Sushi, $20</h2><p>Sushi Yoshi is very, very good -- almost Tachibana good.  It's also owned by Japanese people, and the quality of the fish is high.  They have a great happy hour with half off rolls.  But here's a massive protip: if you go here, order the chirashi.  It is one of the best dishes/values I've ever had at a sushi restaurant and <strong>arguably my favorite dish in NOVA.</strong>  $15 for a big plate of fish and a load of rice topped with stuff that I can't recognize but tastes delicious.<p><p>Parking here is a nightmare; park on the sloped road next to the restaurant rather than trying to find parking on the main street or in a lot.  And make a reservation, because this place is tiny.</p>", "price" : "med", "ethnicity" : [ "Japanese" ], "tags" : [ "BestOf" ], "coordinates" : { "lng" : "-77.266945", "lat" : "38.901733" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4dd" }, "name" : "Lotus Garden", "description" : "<h2>Chinese, $10</h2><p>Lotus Garden is relatively new, opening within the last year (current year: 2013) in an otherwise uninteresting strip mall in downtown Vienna.  But this place has one of my favorite meals in the entire area: roast pork hand drawn noodle soup.  There's a chef in the kitchen that you can watch pull the noodles by hand, and the noodles/broth/pork combo is so, so, so delicious.  I think it's a meal I could literally eat 3x a week and not get tired of.</p><p>You can not get a more satisfying $8 meal anywhere.</p>", "price" : "low", "ethnicity" : [ "Chinese" ], "tags" : [ "Noodles", "BestOf" ], "coordinates" : { "lng" : "-77.268064", "lat" : "38.898999" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4de" }, "name" : "Myung-Ga Korean Deli", "description" : "<h2>Korean, $10</h2><p>This place specializes in 'lower-end Korean fare,' somewhat akin to street/comfort food.  I'm not sure what the proper analogy is for American cuisine; maybe if a restaurant specialized in stuff like mac and cheese, hot dogs, etc.  The kimbap here is the best kimbap I know of in the area both in variety and value for the price (~$5).  The llabboki (spicy ramen noodles mixed with rice cakes) is awesome, especially when paired with the combination kimbap.</p><p>I'm pretty much always down to eat Myung-Ga.  The food is just... comforting.  The Centreville location is more spacious than the Fairfax location but the food is the same.</p><p>Naming it a 'deli' is a bit of a misnomer, as far as traditional American delis go.</p>", "price" : "low", "ethnicity" : [ "Korean" ], "tags" : [ "BestOf" ], "coordinates" : { "lng" : "-77.277761", "lat" : "38.86464" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4df" }, "name" : "Bahn Mi DC Sandwich", "description" : "<h2>Bahn Mi, $3.50</h2><p>Best banh mi in NOVA.  Bahn Mi DC is located near the famous (and in my opinion, over-hyped) Pho 75 off of route 50 in Falls Church.  The chicken is good, but the roast pork here is AWESOME and the single best bahn mi I know of in the area.  The sandwich menu here also appears to be more extensive than the one at Song Que, so I'll venture out into trying other sandwiches in the future and update this review.</p><p>There's no seating here, as the rest of the facility is used to sell Vietnamese groceries.  As of May 1, 2011, there's a sign under the menu that says \"buy 5 sandwiches get 1 free.\"  If you don't want to die, do yourself a favor and take out the small green peppers from the sandwich before you eat it (or ask them not to put peppers in when you order).</p>", "price" : "low", "ethnicity" : [ "Vietnamese" ], "tags" : [ "Sandwiches" ], "coordinates" : { "lng" : "-77.194901", "lat" : "38.865978" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4e0" }, "name" : "La Mexicana Bakery and Tacqueria", "description" : "<h2>Mexican, $10</h2><p>Similar to R&amp;R Tacqueria but not nearly as far.  Located in Alexandria, La Mexicana also offers a similar variety of Mexican dishes (tacos, tortas, sopas, etc) in addition to pastries (which I haven't tried yet).  I've gotten the four tacos with steak/chicken/sausage/beef tongue and they were good; not quite R&amp;R good, but the closest you'll get around here.  Super authentic and fresh tasting.  I've only been here once so I can't comment on any of the other food yet.  The green hot sauce is unreasonably spicy, so beware of that.</p>", "price" : "low", "ethnicity" : [ "Mexican" ], "tags" : [ "Tacos" ], "coordinates" : { "lng" : "-77.083214", "lat" : "38.754421" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4e1" }, "name" : "Vit Goel Tofu & B.B.Q. Restaurant", "description" : "<h2>Soondooboo, $10</h2><p>Soodooboo is a spicy soft bean curd soup with vegetables, which sounds as disgusting as every other Asian dish when it's written out in English.  The soondooboo here is great, in all varieties.  And it's cheap.  Get the mixed, which has the meat and seafood and all that jazz.  Seafood pancake appetizer (pajun) is good too.  But you know what's even better here?  THE CUCUMBER KIMCHI.  Seriously.  I could eat it for the rest of my life.  I think it's marinated in crack.</p>", "price" : "low", "ethnicity" : [ "Korean" ], "coordinates" : { "lng" : "-77.190201", "lat" : "38.833832" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4e2" }, "name" : "Song Que", "description" : "<h2>Bahn Mi, $3.50</h2><p>Song Que is the destination Anthony Bourdain visited for bahn mi during the DC episode of No Reservations.  They're sizable, especially for their price.  If you're hungry you could probably eat two in one sitting.  I typically go with chicken or pork and avoid anything with \"head cheese,\" which is a \"cheese-like\" (?!) substance made with head-meat... yeah.  The bubble tea here is very fresh.  The mango bubble tea tastes like you're literally sticking a straw into a mango, with no added sugar/ingredients.  That being said, the bubble tea at Thanh Son Tofu (down a few stores) is better, so go there for boba.</p>", "price" : "low", "ethnicity" : [ "Vietnamese" ], "tags" : [ "Sandwiches" ], "coordinates" : { "lng" : "-77.153572", "lat" : "38.872787" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4e3" }, "name" : "Thanh Son Tofu / Bubble Tea", "description" : "<h2>$3.50, Bubble Tea</h2><p>Thanh Son is in the parking madness but eating goodness that is Eden Center, on the far left wall of the shopping center.  It&#39;s called &quot;Thanh Son Tofu&quot; because there are lots of old Vietnamese grandmas waiting in line to buy bags of tofu, which means you know the place really knows their bean curd.  I&#39;m not much of a bean curd guy so I stick to the bubble tea.</p><p>For $3.50 you can choose a very sizable bubble tea in a variety of flavors (normal: strawberry, coffee, pineapple, taro, mango, etc... weird: durian) with quality bubbles and/or jelly.  Being lactose intolerant, I was pleased that they could accommodate my request for no milk.  The bubble &quot;tea&quot; (smoothie) here is the best I&#39;ve had in VA; better than Song Que.  They have a lot of other interesting looking offerings here than I&#39;m unfamiliar with (rice dishes paired with mushrooms and other vegetables) that I&#39;d like to try but have no idea how to order.  I often feel that way in Eden Center.</p>", "price" : "low", "ethnicity" : [ "Vietnamese" ], "tags" : [ "Dessert" ], "coordinates" : { "lng" : "-77.153465", "lat" : "38.872829" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4e4" }, "name" : "Tony's New York Pizza", "description" : "<h2>Pizza by the slice, $2-$3/slice</h2><p>The best pizza by the slice in NOVA.  Large selection to choose from, including pizzas that feign authenticity by including toppings like arugula and olive oil.  Large, crispy thin crust slices.  They have pastas and gelato and whatnot here, but why bother with that stuff when you could be eating more pizza?", "price" : "low", "ethnicity" : [ "Italian" ], "tags" : [ "Pizza" ], "coordinates" : { "lng" : "-77.399673", "lat" : "38.855190" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4e5" }, "name" : "Church Street Pizza", "description" : "<h2>Pizza by the slice, $2</h2><p>There&#39;s a serious lack of quality NY-style pizza by the slice joints in NOVA.  You can get a solid slice at Church Street Pizza, which is easy to miss on one of the back streets of Vienna.  It&#39;s next to a dance studio.  It&#39;s also perpetually filled with soccer moms and their children, for better or for worse.  The only pizza I like better in the area is Tony&#39;s NY Style Pizza in the Fair Lakes Shopping Center.</p>", "price" : "low", "ethnicity" : [ "Italian" ], "tags" : [ "Pizza" ], "coordinates" : { "lng" : "-77.265427", "lat" : "38.903267" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4e6" }, "name" : "Smashburger", "description" : "<h2>Burgers, $10</h2><p>The concept behind 'Smashburger' is that they physically smash their burger patties into the griddle, shortening cook time and crisping up the edges of the meat.  I can dig it.  I'm not a huge fan of a super greasy, non-Rays burger (see: Five Guys) and Smashburger eats like a cleaner, fresher burger.  I typically just order a classic and it's pretty similar to standard Shake Shack fare, except I prefer the thinner smashburger patty.  Offerings like garlic/rosemary fries are also good.</p>", "price" : "low", "ethnicity" : [ "American" ], "tags" : "Burgers", "coordinates" : { "lng" : "-77.295785", "lat" : "38.863704" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4e7" }, "name" : "Pomodoro Pizza and Pasta", "description" : "<h2>Pizza and Pasta, $3/slice</h2><p>A very good NY-style pizza/pasta joint in Fairfax, near the Fairfax Corner/Costco area.  They have pizza by the slice available most days (I think it stops after 5pm on Friday and weekends), and their pizzas are made fresh in an easily visible kitchen area.  I'm a pizza person so I've only tried one pasta dish but you could tell it was made by someone who knew how to make a proper pasta sauce.</p><p>A very good place to carryout for a big party, because their large pies are enormous and a good value for the quality/quanity. I think most of the large specialty pies come out to around $18.</p>", "price" : "low", "ethnicity" : [ "Italian" ], "tags" : [ "Pizza", "Pasta" ], "coordinates" : { "lng" : "-77.369013", "lat" : "38.871256" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4e8" }, "name" : "Santini's New York Style Deli", "description" : "<h2>Hoagies/Pizza, $10</h2><p>Solid selection of different sandwiches, including but not limited to common deli meats.  You can get hot breaded chicken/steak sandwiches here also which is nice.  Sides are good, if you&#39;re in the mood for something like curly fries or onion rings.  I haven&#39;t had the pizza by the slice, but I hear it&#39;s good too.  Conveniently it&#39;s located right next to Oakmarr so you can replenish your energy after frustratingly shanking balls on the driving range (like I do).  They&#39;re hardcore Yankees fans, but I try not to judge them too much while I eat.</p>", "price" : "low", "ethnicity" : [ "American" ], "tags" : [ "Sandwiches", "Pizza" ], "coordinates" : { "lng" : "-77.302956", "lat" : "38.878998" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4e9" }, "name" : "Sunflower Vegetarian Rstrnt", "description" : "<h2>Vegetarian, $10</h2><p>I&#39;m nowhere near vegetarian, but Sunflower is solid eats.  It&#39;s essentially vegetarian Chinese food, and they even make variants of common Chinese favorites like &quot;General Tso&#39;s Surprise.&quot;  While that may sound like a train wreck, it&#39;s actually an excellent dish -- made with seitan, the soy protein, instead of chicken. Believe it or not, I might even prefer &quot;General Tso&#39;s Surprise&quot; to the real thing.  The other dishes are good too, but I can&#39;t remember any off the top of my head.</p>", "price" : "low", "ethnicity" : [ "Chinese" ], "tags" : [ "Vegetarian" ], "coordinates" : { "lng" : "-77.275368", "lat" : "38.893013" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4ea" }, "name" : "Original Pancake House", "description" : "<h2>Breakfast Food, $10</h2><p>Since IHOP sucks, go to OHOP.  I&#39;m not sure how many eggs they use to make their omelettes here but they resemble a small yellow tire on your plate.  They offer a variety of pancakes on the menu with various embedded fruits, and you can substitute specialty pancakes into your order for a small charge.  I don&#39;t really eat out for breakfast often, but when I do OHOP doesn&#39;t disappoint.</p>", "price" : "low", "ethnicity" : [ "American" ], "tags" : [ "Breakfast" ], "coordinates" : { "lng" : "-77.197533", "lat" : "38.876293" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4eb" }, "name" : "Founding Farmers", "description" : "<h2>American (Brunch), $10</h2><p>I haven't been to Founding Farmers for dinner (which I hear is amazing but more expensive) but the Saturday brunch here is fantastic.  The brunch is unexpectedly cheap for a restaurant of this quality at around $10/plate, and they're big on organic foods and sustainable farming practices so the ingredients are high quality (well, at least that's what they say).  The brunch beignets are very popular and pretty decadent.  Make a reservation because otherwise there's always a wait.  You can generally find street parking within a few blocks of the restaurant.</p>", "price" : "low", "ethnicity" : [ "American" ], "tags" : [ "Brunch" ], "coordinates" : { "lng" : "-77.044891", "lat" : "38.900539" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4ec" }, "name" : "Shilla Bakery", "description" : "<h2>Korean Bakery, $10</h2><p>The breads here are good, as are the shaved ice desserts that are popular in Korean culture.  There's also been a growing level of ethnic diversity among the customers, which is always a plus.  On the downside, Shilla Bakery will always be filled with really loud groups of Korean high schoolers.</p><p>Protip: there are three Shilla Bakerys in NOVA.  The Annandale and Centreville locations are really good, whereas the Fairfax location is horrible.  I don't understand what causes the discrepancy but it's there.</p>", "price" : "low", "ethnicity" : [ "Korean" ], "tags" : [ "Dessert" ], "coordinates" : { "lng" : "-77.189255", "lat" : "38.828259" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4ed" }, "name" : "Hai Duong", "description" : "<h2>Vietnamese, $10</h2><p>Hai Duong is located in the Mecca of Vietnamese culture in Northern Virginia otherwise known as Eden Center.  I&#39;ve only tried a couple of the probably 50 eateries in Eden Center, but for broken rice / grilled pork dishes (one of my absolute favorite meals in Vietnamese cuisine) Hai Duong does not disappoint.  I always order the same thing (#16) so I can&#39;t comment on the other types of non-rice dishes here, but believe it or not when I make the trip to Eden I more often end up at Hai Duong than Song Que.  Food comes out super quickly which is always nice.</p>", "price" : "low", "ethnicity" : [ "Vietnamese" ], "coordinates" : { "lng" : "-77.154266", "lat" : "38.874027" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4ee" }, "name" : "Super Chicken", "description" : "<h2>Peruvian Chicken, $8-$10</h2><p>I don't really understand the hype around Peruvian chicken, but I do think this place is one of the better places I've had in the NOVA area.  The parking situation here is terrible, so if you're coming during a busy time expect to park near Elevation Burger and walk down the street.  They also don't have the reputation of being the most courteous servers in the world but I don't know why people expect Ritz level service for an $8.50 meal.  A half chicken with two sides is a serious size; I like the yucca fries (potatoes on steroids) and salad.  It seems to be on the average-to-lower end of prices for similar Peruvian chicken joints in the area.</p>", "price" : "low", "ethnicity" : [ "Peruvian" ], "coordinates" : { "lng" : "-77.175674", "lat" : "38.880146" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4ef" }, "name" : "Brio Tuscan Grille", "description" : "<h2>Happy Hour ($2.50 plates)</h2><p>The only reason Brio is on this map is because the happy hour menu is one of the best I know of in the area.  Substantial $2.50 plates, including a real-sized hamburger, ravioli, flatbreads, bruschetta, spinach/artichoke dip, etc.  I'm not a drinker so I can't comment on drink specials but the food is super cheap in the bar area from 3pm-7pm and 9pm-close on weekdays.  Generally not worth the money for anything other than HH.  Brio is located In Tysons 1, downstairs near Barnes and Noble.</p>", "price" : "low", "ethnicity" : [ "American" ], "tags" : [ "Happy Hour" ], "coordinates" : { "lng" : "-77.218613", "lat" : "38.917816" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4f0" }, "name" : "Elephant Jumps", "description" : "<h2>Thai, $10-$15</h2><p>My recent and most significant revelation when it comes to Thai food (inspired by Duangrats) is that while most people order noodle dishes like Pad Thai, the best meals at quality Thai restaurants are fish dishes.  \"Elephant Jumps\" is a strange name but the food is good; maybe not Duangrats-level but few restaurants are.</p><p>The green curry is delicious, but my favorite dish is the crispy tilapia with crispy basil.  I've had the crispy flat bread shrimp appetizer and it was also good.  They have four levels of spicy here -- mild, medium, hot and \"Thai hot\".  My tolerance for spicy food has decreased over the years so I generally order mild curry but it still has a pleasant kick.  Order \"Thai hot\" at your own peril.</p>", "price" : "med", "ethnicity" : [ "Thai" ], "coordinates" : { "lng" : "-77.226105", "lat" : "38.866695" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4f1" }, "name" : "La Caraquena", "description" : "<h2>Latin American, $10-$15</h2><p>I've had Mexican food, I've had Peruvian chicken, but I've never really ventured into other forms of Latin American cuisine.  La Caraquena was an awesome introduction into all things beyond the crunchwrap supreme (which is awesome).  It was also featured on Diners, Drive-ins and Dives on the Food Network but it doesn't really seem to fall under any of those categories.  While the interior is cramped and it's located in a crappy motel, it's not dirty or disorganized and the food is excellent.</p><p>There's a nice variety of arepas (cornmeal sandwiches) and the meat/steak dishes were very well seasoned and cooked perfectly.  But the best things ever are the saltenas, which are more or less the spanish version of a samosa or a big deep fried dumpling.  The saltenas aren't on the menu and not always available, but if you get lucky I consider them one of the best appetizers to order at any restaurant anywhere.&nbsp; The only caveat to the saltenas is that they're somewhat pricey for what they are, and can be obtained for significantly cheaper at Julia's Empanadas in Adams Morgan.&nbsp; But that means you have to be in Adams Morgan, and they still aren't as good as the ones here.<p>", "price" : "med", "ethnicity" : [ "Mexican" ], "coordinates" : { "lng" : "-77.173698", "lat" : "38.884361" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4f2" }, "name" : "Good Stuff Eatery", "description" : "<h2>Burgers/Fries/Shakes, $10-$15</h2><p>Kind of a hike to the Capitol South/Eastern Market area, but the food is solid and you&#39;ll probably catch a glimpse of the semi-famous owner, Spike from Top Chef.  Basically Spike ate at Shake Shack in NYC, asked himself &quot;Hmm, how can I copy this in almost every way but make it better?&quot; and opened Good Stuff.  The Obama burger is my favorite, but even the plain burger is really good.  For a side get the onion petals, and the chipotle/mango mayo dipping sauces are the best.  The sriracha one is okay, if you like the stuff they use in spicy tuna rolls.  The old bay mayo is disgusting.</p>", "price" : "med", "ethnicity" : [ "American" ], "tags" : [ "Burgers" ], "coordinates" : { "lng" : "-77.001793", "lat" : "38.886723" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4f3" }, "name" : "Joe's Burgers", "description" : "<h2>Burgers, $13</h2><p>Joe&#39;s Burgers is one of the few legitimate contenders to Ray&#39;s Hell Burger that I&#39;ve had in NOVA.  It&#39;s located in a very small, very loud, very parking unfriendly location in McLean, but the burgers and fries are seriously great. Probably the best sweet potato fries I&#39;ve ever had.  Although this is very much a palate-specific assessment, I think the specialty burgers here are more appealing than the ones at Rays with a greater variety of toppings and flavors.</p><p>At the suggestion of the waiter (who was cool) I got the chorizo burger, which according to the website contains &quot;HOUSEMADE BERKSHIRE PORK SAUSAGE WITH ROMESCO SAUCE, FRIED ORGANIC EGG, JALAPENO JACK CHEESE, SMOKED MAYONNAISE.&quot;  It. Was. Awesome.  Blue cheese loving friends say the Port Wine Blue Cheese was fantastic, and I&#39;ve also enjoyed the French Dip.</p><p>The downsides: a smidgen more expensive than Rays, smaller and lower quality burger patties than Rays (unavoidable), a wait during busy times, very loud inside and families with little kids dressed in little league apparel dominate the clientele.  But that&#39;s McLean for you.</p>", "price" : "med", "ethnicity" : [ "American" ], "tags" : [ "Burgers" ], "coordinates" : { "lng" : "-77.175697", "lat" : "38.933407" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4f4" }, "name" : "Yechon Korean Restaurant", "description" : "<h2>Korean, $15</h2><p>Yechon was the 24 hour Korean restaurant that started it all, at the first stoplight into Annandale off of 495.  People hate on Yechon for whatever reason but I love it; it's cheap, the banchan isn't skimpy, they speak English, and the lunch specials are great for around $10. I more or less only order the mixed rice with galbi (galbi dolsot bibimbap), but that's just my preference rather than a recommendation.  Spicy shredded beef soup (yukgaejang) is also good, as is the seafood pancake (haemul pajun).  Not a place you'd want to order sushi, even though they offer it.</p>", "price" : "med", "ethnicity" : [ "Korean" ], "coordinates" : { "lng" : "-77.209953", "lat" : "38.833759" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4f5" }, "name" : "Four Sisters Restaurant", "description" : "<h2>Vietnamese, $10-$15</h2><p>Four Sisters' reputation as one of the best low-priced restaurants in NOVA is well deserved, as the food is great.  You can get standard stuff like vermicelli bowls or chairbroiled pork dishes, but the best things here are the dinner combos (i.e. dinner for 2, dinner for 4, dinner for 8, etc.)  Try the papaya or lotus root salads, which might be my favorite things on the menu.  You'll probably need a reservation on a weekend evening.<p><p>(EDIT 9/18/2011): I play basketball at the gym with the executive chef of Four Sisters, and I had the opportunity to ask him what he considered the best items on the menu.  I tried his recommendations -- black pepper beef and the sea bass -- and they were great.  So my current reccs include the lotus root salad, black pepper beef, and the crispy sea bass in black bean sauce.</p>", "price" : "med", "ethnicity" : [ "Vietnamese" ], "coordinates" : { "lng" : "-77.228012", "lat" : "38.873020" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4f6" }, "name" : "Skorpios Maggio's Restaurant", "description" : "<h2>Gyros, $10-$15</h2><p>A solid family run operation, where you can order a massive gyro that you probably shouldn't eat in one sitting.  Plaka Grill up the road has a better gyro, but it's significantly smaller and roughly the same price so not worth it.  They've given out small pieces of chocolate baklava on the house the last 2 times I've been there, which was nice.  The chicken wings here are the best chicken wings I've ever had.  Literally just deep fried chicken wings, no sauce.  Literally amazing.</p>", "price" : "med", "ethnicity" : [ "Greek" ], "coordinates" : { "lng" : "-77.257256", "lat" : "38.907887" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4f7" }, "name" : "China Wok", "description" : "<h2>Peking Duck/Chinese, $10-$30</h2><p>I've had some seriously underwhelming meals at China Wok in the past, and I had no idea this was a worthy establishment until this past weekend when I went with a friend who spoke Chinese. The lunch specials/American-style Chinese food here is standard mall-worthy crap, but the authentic Chinese dishes are much, much better.  I haven't tried much of the menu yet but apparently the chef here moved from the highly regarded restaurant Oriental Regency that used to be down the street.</p><p>The Peking Duck here is a particularly great value at $28, especially compared to the $45 duck at Peking Gourmet Inn.  It comes with an entire crispy duck which is carved at the table, pancakes, hoisin sauce and green onions.  The markup at Peking Gourmet Inn is not worth it if you want duck alone, although the menu there is more extensive than the one here.  If you go to China Wok just remember not to get something typical like \"orange chicken,\" because it will suck.</p>", "price" : "med", "ethnicity" : [ "Chinese" ], "coordinates" : { "lng" : "-77.237305", "lat" : "38.922848" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4f8" }, "name" : "Bon Chon Chicken", "description" : "<h2>Fried Chicken, $12 med/$20 large</h2><p>Bon Chon should seriously be on every street corner in the US.  The owners should be billionaires; they&#39;re sitting on a winning lottery ticket but have no idea how to market their product.  Bon Chon is chicken fried multiple times and glazed with a soy-garlic sauce, resulting in a product that&#39;s strangely super crispy yet not messy to eat.  It&#39;s like the evolution of popeyes/KFC/insert other preconception of fried chicken.  And the drumsticks are the size of your head.</p><p>Protips:<br/>(1) Call ahead and place your order, because the chicken takes at least an hour to prepare;<br/>(2) Every time I&#39;ve had the &quot;spicy&quot; it&#39;s been unenjoyably spicy, so I avoid it now;<br/>(3) I always order &quot;large drumsticks only.&quot;  Also, for reasons that defy all reason and logic Bon Chon doesn&#39;t have call waiting at the Annandale location.  The Fairfax location has better decor and a more competent wait staff.</p>", "price" : "med", "ethnicity" : [ "Korean" ], "coordinates" : { "lng" : "-77.172531", "lat" : "38.824356" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4f9" }, "name" : "Oegadjib Restaurant", "description" : "<h2>Korean BBQ, $20</h2><p>If you want to eat all you can eat pork belly (samgyupsal) and non-galbi beef, oegadjib is probably your best bet for around $20 including tip.  That being said, all you can eat pork belly will probably take years off your life.  That being said, all you can eat pork belly is awesome.  The banchan here is definitely better than honeypig.  They have all you can eat shabu shabu here too, but if I have to choose between meat and shabu shabu, I never choose shabu shabu.</p><p>And this place is pronounced 'weh-gah-jeeb'.  I don't know why they picked a name that did not lend itself at all to an English variation.</p>", "price" : "med", "ethnicity" : [ "Korean" ], "coordinates" : { "lng" : "-77.198708", "lat" : "38.830235" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4fa" }, "name" : "Mark's Duck House", "description" : "<h2>Dim sum, $20</h2><p>I'm a fan of dim sum, but I've never had great dim sum in VA.  The only place I've had great dim sum is NYC's Chinatown.  Mark's Duck House is adequate, given the alternatives (\"Fortune\" across the street is mediocre), but I don't think either is particularly stellar.  I'm also not a huge fan of the more popular dim sum places in Wheaton/Silver Spring, MD.  At the end of the day, for a dim sum fix in VA, go here.</p>", "price" : "med", "ethnicity" : [ "Chinese" ], "coordinates" : { "lng" : "-77.147415", "lat" : "38.870064" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4fb" }, "name" : "Mad Fox Brewing Company", "description" : "<h2>Burgers/Pizza/Beer, $15</h2><p>Okay, so the service at Mad Fox is terrible.  I&#39;ve been there multiple times for lunch with coworkers and it&#39;s taken us 30 minutes to get our food with nobody else in the restaurant.  That being said, the food here is excellent, and the bbq brisket sandwich is one of the best I&#39;ve ever had.  Fries are great.  Pizza is good.  Ketchup is homemade.  Gah; if they could hire a competent wait staff this place would be off the charts.  So in the end, if you&#39;re in a patient mood and not pressed for time, it&#39;s a worthwhile place to go eat.</p>", "price" : "med", "ethnicity" : [ "American" ], "coordinates" : { "lng" : "-77.177116", "lat" : "38.886284" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4fc" }, "name" : "Pasta Mia", "description" : "<h2>Pasta, $16</h2><p>While I haven&#39;t eaten enough pasta in the area to know, I wouldn&#39;t be surprised if Pasta Mia was in the running for best pasta in the DC area.  Located in Adams Morgan, it&#39;s a small, family-run, cash only operation marked by the huge line outside its building.  So the way it works is you line up before the restaurant opens and they let in the first 25 or so people, in order.  Those people place their orders, in order, and the single old male chef makes their orders, in order.  After a table clears a new set of patrons are seated.  Basically, if you&#39;re number 26 you&#39;re going to be waiting outside for over an hour, so get their early and wait.  The food is handmade and excellent.  Portions are enormous.</p>", "price" : "med", "ethnicity" : [ "Italian" ], "tags" : [ "Pasta" ], "coordinates" : { "lng" : "-77.042213", "lat" : "38.922806" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4fd" }, "name" : "Metro 29 Diner Restaurant", "description" : "<h2>Diner Food, $10-$15</h2><p>Metro 29 is a good quality diner in Arlington off of Route 29 (Lee Highway).  The menu here is surprisingly extensive, including an entire array of seafood dishes that have no business being on a diner menu.  I haven&#39;t ventured in the seafood areas, but the breakfast and dinner entrees are good.  It was featured on Food Network on &quot;Diners, Drive Ins and Dives.&quot;", "price" : "med", "ethnicity" : [ "American" ], "tags" : [ "Diner" ], "coordinates" : { "lng" : "-77.122894", "lat" : "38.897999" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4fe" }, "name" : "Bistrot Du Coin", "description" : "<h2>French, ~$25</h2><p>A nice mid-scale French restaurant in DC that specializes in mussels and steak frites.  Both were excellent when I went. It isn't the cheapest place but I don't feel ripped off when I go there because the food quality is high.  I think it's impossible for mussels to be filling (I could probably eat 100 mussels in a single sitting) but the different broths that the mussels are cooked in are really fantastic.  I think going with a small group of people is in your best interest to defer costs for appetizers like mussels while still maintaining variety in your order.  Parking can be a pain in the neck, but that's expected with most of DC.</p>", "price" : "high", "ethnicity" : [ "French" ], "coordinates" : { "lng" : "-77.046112", "lat" : "38.913822" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a4ff" }, "name" : "Korshi Buffet", "description" : "<h2>Japanese/Korean Buffet, $30</h2><p>Korshi is in Centreville so it can be a trek depending on where you live, but I think it's better than all the other Japanese/Korean buffets that I've been to so far: Todai, HeeBeen and the lowly IlMee included.&nbsp; The variety of sushi/rolls here is ridiculous; probably twice the size of the other places and with expensive types of sushi included (sea urchin, white tuna, fatty tuna, etc.)</p><p>They also cook the Korean BBQ at your table for you, and while buffet meats are never stellar they were better than the other places I've mentioned.&nbsp; The decor is nice, it's very clean, and the other buffet items seem to be fancier (i.e. raw oysters) for the same $30 price tag.&nbsp; All that being said... I should probably stop eating so many buffets.<p>", "price" : "high", "ethnicity" : [ "Asian" ], "tags" : [ "Buffet" ], "coordinates" : { "lng" : "-77.423019", "lat" : "38.838116" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a500" }, "name" : "Honey Pig", "description" : "<h2>Korean BBQ, $20-30+</h2><p>A 24 hour bbq joint that has its busiest hours (no lie) from 12am-4am on weekends.  That's when all the NOVA azns are returning from da klubz, which is why you should avoid honey pig like the plague from 12am-4am.  Otherwise, it's a relatively cheap place to get a variety of meats cooked at your table, if you don't mind the sound of really loud and really bad Korean techno.</p><p>It tends to appeal to a younger crowd and the meat quality isn't the greatest here, but it's still the most economical way to eat Korean BBQ that I know of (aside from cooking it yourself).  The greens and sesame oil salad that they give you with the meat is great.  Lots of alcohol here, if you're into that type of thing.  It's probably going to cost around $25-$30 to eat enough meat to be full, but you should be seriously full.</p><p>The Centreville and Annandale locations are pretty much equivalent in every way.</p>", "price" : "high", "ethnicity" : [ "Korean" ], "tags" : [ "Meat", "BestOf" ], "coordinates" : { "lng" : "-77.194122", "lat" : "38.831692" } }
{ "_id" : { "$oid" : "51ba0edd72d2102925e1a501" }, "name" : "Peking Gourmet Inn", "description" : "<h2>Peking Duck/Chinese, $45</h2><p>The duck here is famous and for good reason, as it is excellent.  It's also overpriced like nobody's business.  $45 for a single duck.  This place is popularized by the presence of hundreds of photos of politicians and dignitaries on the walls, especially George Bush.  Why George Bush's preference for eating at your restaurant is a positive endorsement is beyond me.  Despite my inability to get over my political leanings when writing restaurant reviews, the food here is definitely good.  Going without a reservation is pointless during prime times.  The odd-hour \"lunch for x\" deals are a better bang for the buck.</p>", "price" : "high", "ethnicity" : [ "Chinese" ], "tags" : [ "Duck" ], "coordinates" : { "lng" : "-77.139603", "lat" : "38.855694" } }
{ "name" : "China Garden", "description" : "<h2>Dim Sum, $20</h2>\r\n<p>The most significant and immediate thing to know about China Garden is that it is impossible to find.  It is located INSIDE the ABC news building.  There is no sign (at least that I saw) from the outside that indicates this, and Rosslyn is such a bewildering area to drive in that the hidden nature of this place will give you a headache.  Basically just find parking at the closest intersection when the GPS indicates that you're relatively close.  Apparently there's also parking in the building but unsurprisingly I couldn't find it.</p>\r\n<p>The dim sum here though, in my experience, is very good.  I like it better than the alternative offerings in VA (Marks Duck House and the woeful Fortune) and I doubt it's much different than the highly lauded restaurants in Maryland.  The employees with the food carts are numerous and eager to distribute plates so finding what you want isn't difficult.  As with any dim sum it's in your benefit to go in a group to bring down costs.  As a price point I paid $20 for a LOT of food in a group of three people, so YMMV.</p>", "price" : "low", "_id" : { "$oid" : "51ba116aca392e4608000002" }, "coordinates" : { "lat" : "38.894874", "lng" : "-77.070232" }, "tags" : [ "Dim Sum" ], "ethnicity" : [ "Chinese" ], "__v" : 0 }
